In [1]:
x = 5

# Intro to Jupyter
## Shortcuts
- running code: CTRL ENTER
    - running code and move on to the next cell: SHIFT ENTER 
- two versions of boxes: markdown vs cells
- SHIFT TAB within the brackets of a formulas --> will show you hints

In [18]:
#import bogfunctions as bt
#bt.fnCube(5)

# Intro to Pandas

## Importing and Exploring Data

In [3]:
import pandas as pd
df = pd.read_csv('StockData/SP500.csv')

#comments

#notes to yourself

In [12]:
text = "Bogdan\nTudose"
print(text)

Bogdan
Tudose

In [15]:
#df2 = pd.read_csv(r'\\NAEAST.AD.JPMORGANCHASE.COM\HOME2\NAHOME00002\V806013\jpmDesk\Desktop\DS Apr 2024\Python Project\StockData\aapl.csv')

In [14]:
df2.head()

       Date       Open       High        Low      Close  Adj Close    Volume
0  10/01/13  68.349998  69.877144  68.339996  69.708572  63.523125  88470900
1  10/02/13  69.375717  70.257141  69.107140  69.937141  63.731426  72296000
2  10/03/13  70.072861  70.335716  68.677139  69.058571  62.930801  80688300
3  10/04/13  69.122856  69.228569  68.371429  69.004288  62.881340  64717100
4  10/07/13  69.508568  70.378571  69.335716  69.678574  63.495800  78073100

In [4]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,9/30/13,1687.260010,1687.260010,1674.989990,1681.550049,1681.550049,3308630000
1,10/01/13,1682.410034,1696.550049,1682.069946,1695.000000,1695.000000,3238690000
2,10/02/13,1691.900024,1693.869995,1680.339966,1693.869995,1693.869995,3148600000
3,10/03/13,1692.349976,1692.349976,1670.359985,1678.660034,1678.660034,3279650000
4,10/04/13,1678.790039,1691.939941,1677.329956,1690.500000,1690.500000,2880270000

In [9]:
finDeals = pd.read_excel('ExData/Data Manipulation Worksheet.xlsx') #SHIFT TAB
    #table with financial deals
finDeals.head()

,DATE,ISSUER,TYPE,SIZE,INDUSTRY,LEAD UNDERWRITER
0,2006-01-28,US Bank N.A.,Global Notes,1000.21,Finance,Lehman Brothers
1,2006-01-28,Alliance National Muni Income Fund,Initial Public Offering,283.6,Finance,Salomon Smith Barney
2,2006-01-28,Lloyds Bank Plc NY,CD Notes,200.58,Finance,Merrill Lynch
3,2006-01-28,FBR Asset Investment Corp,Equity Follow-On Offering,127.2,Real Estate,"Friedman, Billings, Ramsey"
4,2006-01-28,Alliance California Muni Income Fund,Initial Public Offering,117.1,Finance,Salomon Smith Barney

In [8]:
#!pip install openpyxl

**Tips for exploring data with pandas**
- `.info()`, `.head()`, `.tail()`
    - check the data types (dates should be datetime, numbers should be int or float)
    - make sure there are no blanks

- method --> is like a function that works for specific objects/data types
    - pandas --> DataFrame object --> table
    - dataframe methods --> formulas that go at the end of the table name
    - table.info()
- function --> is more generic, it doesn't go at the end of a variable
    - read_csv(inputs, inputs)
 
- deal with blank columns
    - .fillna() or .dropna()

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       1260 non-null   object
 1   Open       1260 non-null   float64
 2   High       1260 non-null   float64
 3   Low        1260 non-null   float64
 4   Close      1260 non-null   float64
 5   Adj Close  1260 non-null   float64
 6   Volume     1260 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 69.0+ KB

In [20]:
finDeals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 568 entries, 0 to 567
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   DATE              557 non-null    datetime64[ns]
 1   ISSUER            564 non-null    object
 2   TYPE              558 non-null    object
 3   SIZE              558 non-null    object
 4   INDUSTRY          557 non-null    object
 5   LEAD UNDERWRITER  557 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 26.8+ KB

In [23]:
# finDeals.head()
finDeals.tail(20) #last 20 rows

,DATE,ISSUER,TYPE,SIZE,INDUSTRY,LEAD UNDERWRITER
548,2006-06-19,Comerica Bank,CD Notes,300.11,Finance,Merrill Lynch
549,2006-06-19,Consolidated Edison Inc.,Notes,300.12,Utility,Salomon Smith Barney
550,2006-06-20,MBNA Capital Securities D,Preferred Securities,300.1,Finance,Salomon Smith Barney
551,2006-06-20,Anworth Mortgage Asset Corp,Equity Follow-On Offering,117,Real Estate,"Friedman, Billings, Ramsey"
552,2006-06-21,Alabama Power Company,Sr Notes,350,Utility,Lehman Brothers
553,2006-06-21,Sears Roebuck Acceptance Corp,Sr Notes,250.1,Finance,Merrill Lynch
554,2006-06-21,DQE Inc,Equity Follow-On Offering,202.5,Utility,Lehman Brothers
555,2006-06-21,MassMutual,Global Notes,200.1,Finance,Morgan Stanley
556,2006-06-21,Conceptus Inc,Equity Follow-On Offering,72,Healthcare,UBS Warburg
557,NaT,NaN,NaN,NaN,NaN,NaN
558,NaT,NaN,NaN,NaN,NaN,NaN
559,NaT,NaN,NaN,NaN,NaN,NaN
560,NaT,NaN,NaN,NaN,NaN,NaN
561,NaT,ISSUER,LEAD UNDERWRITER,SIZE,NaN,NaN
562,NaT,Linens 'n Things Inc,NaN,NaN,NaN,NaN
563,NaT,MBNA Capital Securities D,NaN,NaN,NaN,NaN
564,NaT,Husky Oil Ltd.,NaN,NaN,NaN,NaN
565,NaT,ProQuest Co,NaN,NaN,NaN,NaN
566,NaT,TXU Corp,NaN,NaN,NaN,NaN
567,NaT,United Dominion Realty Trust Inc.,NaN,NaN,NaN,NaN

## Re-import and fix the data

In [24]:
finDeals = pd.read_excel('ExData/Data Manipulation Worksheet.xlsx', skipfooter=11)
        #skip the last 11 rows
        #useful if it's ALWAYS 11 rows at bottom that you need to delete

In [27]:
finDeals = pd.read_excel('ExData/Data Manipulation Worksheet.xlsx', sheet_name='Financing Table Clean')
                                                                    #sheet_name=1

In [28]:
finDeals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 557 entries, 0 to 556
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   DATE              557 non-null    datetime64[ns]
 1   ISSUER            557 non-null    object
 2   TYPE              557 non-null    object
 3   SIZE              557 non-null    float64
 4   INDUSTRY          557 non-null    object
 5   LEAD UNDERWRITER  557 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 26.2+ KB

In [29]:
sp500 = pd.read_csv('StockData/SP500.csv',parse_dates=['Date'])

C:\Users\V806013\AppData\Local\Temp\4\ipykernel_39352\387737003.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sp500 = pd.read_csv('StockData/SP500.csv',parse_dates=['Date'])

In [32]:
pd.__version__

'2.0.3'

In [34]:
test = pd.read_csv('ExData/ff3_daily.csv', parse_dates=['date'])

In [38]:
# test.info()
# test.head() # yyyy-mm-dd
# sp500.head()

In [39]:
sp500.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2013-09-30,1687.260010,1687.260010,1674.989990,1681.550049,1681.550049,3308630000
1,2013-10-01,1682.410034,1696.550049,1682.069946,1695.000000,1695.000000,3238690000
2,2013-10-02,1691.900024,1693.869995,1680.339966,1693.869995,1693.869995,3148600000
3,2013-10-03,1692.349976,1692.349976,1670.359985,1678.660034,1678.660034,3279650000
4,2013-10-04,1678.790039,1691.939941,1677.329956,1690.500000,1690.500000,2880270000

In [40]:
#Extractng Data
#table.iloc[row][column] --> integer location, row numbers
sp500.iloc[1]['Close']

1695.0

In [42]:
sp500 = pd.read_csv('StockData/SP500.csv',parse_dates=['Date'],index_col=['Date'])
# sp500.head()
sp500.iloc[1]['Close']

C:\Users\V806013\AppData\Local\Temp\4\ipykernel_39352\2533846645.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sp500 = pd.read_csv('StockData/SP500.csv',parse_dates=['Date'],index_col=['Date'])

1695.0

In [43]:
sp500.loc['2013-10-01']['Close']

1695.0

In [47]:
# sp500.loc['2015-01'][['Close','Open']]
# sp500[['Close','Open']]
sp500.loc['2015-01-01':'2015-03-31']

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2015-01-02,2058.899902,2072.360107,2046.040039,2058.199951,2058.199951,2708700000
2015-01-05,2054.439941,2054.439941,2017.339966,2020.579956,2020.579956,3799120000
2015-01-06,2022.150024,2030.250000,1992.439941,2002.609985,2002.609985,4460110000
2015-01-07,2005.550049,2029.609985,2005.550049,2025.900024,2025.900024,3805480000
2015-01-08,2030.609985,2064.080078,2030.609985,2062.139893,2062.139893,3934010000
...,...,...,...,...,...,...
2015-03-25,2093.100098,2097.429932,2061.050049,2061.050049,2061.050049,3521140000
2015-03-26,2059.939941,2067.149902,2045.500000,2056.149902,2056.149902,3510670000
2015-03-27,2055.780029,2062.830078,2052.959961,2061.020020,2061.020020,3008550000
2015-03-30,2064.110107,2088.969971,2064.110107,2086.239990,2086.239990,2917690000
2015-03-31,2084.050049,2084.050049,2067.040039,2067.889893,2067.889893,3376550000

## Adding Custom Columns

In [50]:
sp500['Volume (mm)'] = sp500['Volume'] / 10**6 #divide by a million
# sp500.head()
sp500['Intraday Returns'] = sp500['Close']  / sp500['Open'] - 1
            # (x1 - y1) / y1 = x1 / y1 - 1

In [51]:
sp500.head(3)

,Open,High,Low,Close,Adj Close,Volume,Volume (mm),Intraday Returns
Date,,,,,,,,
2013-09-30,1687.260010,1687.260010,1674.989990,1681.550049,1681.550049,3308630000,3308.63,-0.003384
2013-10-01,1682.410034,1696.550049,1682.069946,1695.000000,1695.000000,3238690000,3238.69,0.007483
2013-10-02,1691.900024,1693.869995,1680.339966,1693.869995,1693.869995,3148600000,3148.60,0.001164

## Lunch Break until 1pm EST